### Pandas Lab - Finding, Querying, Creating Data

### Section 1: Selecting Data

Complete the following prompts, and compare your results with the answers to confirm that you did the operation properly.

In [ ]:
import pandas as pd
df = pd.read_csv("/Users/theodoreplotkin/desktop/postmalone/GA_Data_Science/DAT-06-24/class material/Unit 2/data/titanic.csv")

**1).** Find the average age of all passengers on board.  The answer will be 29.7

In [5]:
# Your Code Here
format(df["Age"].mean(), ".1f")

'29.7'

**2).** Find the median value of the 'Fare' and 'SibSp' columns.  The answer will be 14.45 and 0.00, respectively.

In [11]:
# Your Code Here
df[["Fare","SibSp"]].median()

Fare     14.4542
SibSp     0.0000
dtype: float64

**3).** Find the median value of the 'Fare' and 'SibSp' columns in the first 100 rows.  The answer will be 15.675 and 0.00.

In [13]:
# Your Code Here
df[["Fare","SibSp"]][:100].median()

Fare     15.675
SibSp     0.000
dtype: float64

**4).** Using the .iloc command, grab the modal value of the last 4 columns in the dataset.  The result should be a 3x3 dataframe that has the values 1601, 8.05, B96 B98, and S in the first row.

In [24]:
# Your Code Here
df.iloc[:,-4:].mode()

     Ticket  Fare        Cabin Embarked
0      1601  8.05      B96 B98        S
1    347082   NaN  C23 C25 C27      NaN
2  CA. 2343   NaN           G6      NaN

**5).** Using the .iloc command, grab the mean value of the first 250 rows of the first 3 columns in the dataset.  The answer should be:
    - Passengerid: 125.5
    - Survived: 0.344
    - Pclass: 2.416

In [26]:
# Your Code Here
df.iloc[:250,:3].mean()

PassengerId    125.500
Survived         0.344
Pclass           2.416
dtype: float64

### Section 2: Querying Data

**1).** How many females were on board the Titanic? Men? The answers should be 314, 577

In [32]:
# Your Code Here
print("There were", len(df[df.Sex == "female"]),"females onboard the titanic")
print()
print("There were", len(df[df.Sex == "male"]),"females onboard the titanic")

There were 314 females onboard the titanic

There were 577 females onboard the titanic

**2).** What was the survival rate for females on the Titanic? The answer should be 0.74

In [38]:
# Your Code Here
print(format(df[df.Sex == "female"]["Survived"].mean(), ".2f"),"percent of females survived")

0.74 percent of females survived

**3).** What was the survival rate for Males? The answer should be 0.19

In [40]:
# Your Code Here
print(format(df[df.Sex == "male"]["Survived"].mean(), ".2f"),"percent of females survived")

0.19 percent of females survived

**4).** What was the survival rate for passengers in either Pclass 1 or Pclass 2?  The answer should be 0.55

In [45]:
# Your Code Here
df[(df.Pclass == 1) | (df.Pclass == 2)]["Survived"].mean()

0.5575

**5).** What was the survival rate if you were female and had at least 1 sibling on board? The answer should be 0.686.

In [51]:
# Your Code Here
df[(df.SibSp >= 1) & (df.Sex == "female")]["Survived"].mean()

0.6857142857142857

### Section 3: Creating New Data

**1).** Create a column called 'Is_Alone' that's either True or False, depending on whether or not the column 'Family_Size' is > 0 or not.

In [56]:
import numpy as np
df["Family_Size"] = df["Parch"] + df["SibSp"]

#Your Code Here

df["Is_Alone"] = np.where(df.Family_Size > 0, False, True)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family_Size,Is_Alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,False
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,True

**2).** Create a column called 'Demographic' that breaks people up into the following categories:
 - Below 8 years old: 'Child'
 - 8 - 21 years old: 'Adolescent'
 - 22 - 55 years old: 'Adult'
 - 55+: 'Senior'
 
When you're finished, use the method .value_counts() to confirm each section has the following count values:
 - Child: 50
 - Adolescent: 154
 - Adult: 470
 - Senior: 40

In [64]:
# Your Code Here

#first create a list of conditions 
conditions = [(df.Age < 8),
              (df.Age >= 8) & (df.Age <= 21),
              (df.Age >= 22) & (df.Age < 55),
              (df.Age > 55)]

results = ["Child", "Adolescent", "Adult", "Senior"]

df["Demographic"] = np.select(conditions, results, "other")
df[["Age","Demographic"]].head(10)

df["Demographic"].value_counts()

Adult         468
0             179
Adolescent    154
Child          50
Senior         40
Name: Demographic, dtype: int64

**3).** Create a column called 'Gender_Status' that returns the following values:

 - 'F-High' if passenger is female and passenger class is 1.
 - 'F-Low' if passenger is female and passenger class is 2 or 3
 - 'M-High' if passenger is male and passenger class is 1
 - 'M-Low' if passenger is male and passenger class is 2 or 3
 
When you are finished, use .value_counts() to confirm you have the following count values for each of the following:
 - 'M-Low': 455
 - 'F-Low': 220
 - 'M-High': 122
 - 'F-High': 94

In [70]:
# Your Code Here
conditions = [(df.Sex == "female") & (df.Pclass == 1),
              (df.Sex == "female") & ((df.Pclass == 2) | (df.Pclass == 3)),
              (df.Sex == "male") & (df.Pclass == 1),
              (df.Sex == "male") & ((df.Pclass == 2) | (df.Pclass == 3))]

results = ["F-High", "F-Low", "M-High", "M-Low"]

df["Gender_Status"] = np.select(conditions, results, "other")
df[["Sex","Pclass","Gender_Status"]].head()

      Sex  Pclass Gender_Status
0    male       3         M-Low
1  female       1        F-High
2  female       3         F-Low
3  female       1        F-High
4    male       3         M-Low

In [69]:
df["Gender_Status"].value_counts()

M-Low     455
F-Low     220
M-High    122
F-High     94
Name: Gender_Status, dtype: int64

**4).** Using string methods, extract the *greeting* of the persons name on board.  Ie, if someone's name is 'Ms. Madame Bovary', create a column that contains the value 'Ms.' and nothing else.

**Hint:** Take a look at the split() method and see what it does if you're not sure where to go.

In [161]:
# Your Code Here
titles = []
for names in df["Name"]:
    titles.append(names.split(",")[1].split(" ")[1])

df["Greeting"] = titles

In [168]:
df[["Sex","Name", "Greeting"]].tail(10)

        Sex                                      Name Greeting
881    male                        Markun, Mr. Johann      Mr.
882  female              Dahlberg, Miss. Gerda Ulrika    Miss.
883    male             Banfield, Mr. Frederick James      Mr.
884    male                    Sutehall, Mr. Henry Jr      Mr.
885  female      Rice, Mrs. William (Margaret Norton)     Mrs.
886    male                     Montvila, Rev. Juozas     Rev.
887  female              Graham, Miss. Margaret Edith    Miss.
888  female  Johnston, Miss. Catherine Helen "Carrie"    Miss.
889    male                     Behr, Mr. Karl Howell      Mr.
890    male                       Dooley, Mr. Patrick      Mr.